diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/CommonModules/ВКМ_ДлительныйМодуль/Module.bsl
#Область СлужебныеПроцедурыИФункции
	
	Процедура ПровестиДокументыРеализации(Параметры, АдресРезультата) Экспорт
		
		//МассивВозврат = Новый Массив;
		
		Запрос= Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.ПометкаУдаления
		|			ТОГДА """"
		|		ИНАЧЕ РеализацияТоваровУслуг.Ссылка
		|	КОНЕЦ КАК Реализация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
		|				ТОГДА РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ДоговорыКонтрагентов.ВидДоговора = &АбонентскоеОбслуживание";      
		Запрос.УстановитьПараметр("АбонентскоеОбслуживание",Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		Запрос.УстановитьПараметр("НачалоПериода",Параметры.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",Параметры.КонецПериода);   
		
		Список = Запрос.Выполнить().Выгрузить();
		
		ВсегоДокументов = Список.Количество();
		
		ТекДок = 1;
		
		Для Каждого Стр11 ИЗ Список Цикл
			
			// создание реализации
			Если не ЗначениеЗаполнено(Стр11.Реализация) Тогда 
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = ТекущаяДата();
				Реализация.Заполнить(Стр11.Договор);
				Реализация.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
			ПроцентВыполнения = Окр(ПроцентВыполнения,0);
			
			//МассивВозврат.Добавить(ПроцентВыполнения);
			
			// сообщаем "процент" и "текст сообщения"
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(Строка(Стр11.Контрагент) + " - " + Строка(Стр11.Договор)));
			
			ТекДок = ТекДок + 1;
			
		КонецЦикла;
		
		//ПоместитьВоВременноеХранилище(МассивВозврат, АдресРезультата);
		
	КонецПроцедуры

#КонецОбласти
